earlephilhower/arduino-pico/boards.txt
menu.BoardModel=Model
menu.led=Builtin LED
menu.ResetMethod=Reset Method
menu.dbg=Debug Port
menu.lvl=Debug Level

##############################################################
rpipico.name=Raspberry Pi Pico
rpipico.vid.0=0x2e8a
rpipico.pid.0=0x000a
rpipico.build.board=RPI_PICO
rpipico.build.mcu=cortex-m0plus
rpipico.build.variant=rpipico
rpipico.upload.tool=uf2conv
rpipico.upload.maximum_data_size=81920
rpipico.upload.wait_for_upload_port=true
rpipico.upload.erase_cmd=
rpipico.serial.disableDTR=true
rpipico.serial.disableRTS=true
rpipico.build.led=
rpipico.build.core=rp2040
rpipico.build.mcu=rp2040
rpipico.build.debug_port=
rpipico.build.debug_level=
rpipico.build.ldscript=memmap_default.ld
rpipico.menu.dbg.Disabled.build.debug_port=
rpipico.menu.dbg.Serial=Serial
rpipico.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
rpipico.menu.dbg.Serial1=Serial1
rpipico.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
rpipico.menu.lvl.None____=None
rpipico.menu.lvl.None____.build.debug_level=
rpipico.menu.lvl.SSL=SSL
rpipico.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
rpipico.menu.lvl.TLS_MEM=TLS_MEM
rpipico.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
rpipico.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
rpipico.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
rpipico.menu.lvl.HTTP_SERVER=HTTP_SERVER
rpipico.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
rpipico.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
rpipico.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
rpipico.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
rpipico.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
rpipico.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
rpipico.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
rpipico.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
rpipico.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
rpipico.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
rpipico.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
rpipico.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
rpipico.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
rpipico.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
rpipico.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
rpipico.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
rpipico.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
rpipico.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
rpipico.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
rpipico.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
rpipico.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
rpipico.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
rpipico.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
rpipico.menu.lvl.CORE=CORE
rpipico.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
rpipico.menu.lvl.WIFI=WIFI
rpipico.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
rpipico.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
rpipico.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
rpipico.menu.lvl.UPDATER=UPDATER
rpipico.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
rpipico.menu.lvl.OTA=OTA
rpipico.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
rpipico.menu.lvl.OOM=OOM
rpipico.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
rpipico.menu.lvl.MDNS=MDNS
rpipico.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
rpipico.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
rpipico.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
rpipico.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
rpipico.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
rpipico.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
rpipico.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
